{
  "header": {
    "greeting": "HI, my name is Danila Kulinkovich",
    "web": "WEB",
    "developer": "DEVELOPER",
    "email": "danek200326@gmail.com"
  },
  "nav": {
    "home": "Home",
    "contact": "Contact",
    "skills": "Skills",
    "projects": "Projects",
    "experience": "Experience",
    "about": "About"
  },
  "about": {
    "title": "About Me",
    "subtitle": "Frontend Developer with experience in building user-friendly and high-performance web applications. My core stack includes React, TypeScript, Vite, RTK Query, and SCSS, but I am also confident working with Node.js, databases, cloud services, and preprocessors.",
    "text1": "I combine strong frontend expertise with a solid understanding of backend development, enabling me to contribute effectively across the full development cycle. I know how to transform designs into clean, responsive interfaces and work efficiently with a wide range of libraries and tools.",
    "text2": "Focused on code quality, performance optimization, and user experience. Always eager to learn new technologies and take on exciting projects."
  },
  "contact": {
    "title": "Contact",
    "subtitle": "Let's connect and discover how we can create effective digital solutions together",
    "description": "Any way convenient for you:",
    "formText": "Or send me a message directly here:",
    "name": "Your name",
    "namePlaceholder": "Ivan",
    "email": "Your email",
    "emailPlaceholder": "ivan@example.com",
    "message": "Your message",
    "messagePlaceholder": "Write your message...",
    "send": "Send message",
    "sending": "Sending...",
    "success": "Message sent!",
    "error": "Sending error. Try again later."
  },
  "projects": {
    "title": "My Projects",
    "all": "All",
    "business": "Commercial",
    "pet": "Pet Projects",
    "infoBadge": "Project Info"
  },
  "experience": {
    "title": "Experience",
    "workTitle": "Work Experience",
    "educationTitle": "Education",

    "work": {
      "3": {
        "description": "Landing page creation, frontend development, design, website layout, working with APIs, studying/writing documentation, project deployment, client-server integration",
        "position": "Frontend Developer"
      },
      "2": {
        "description": "Client communication, team building, frontend development",
        "position": "Administrator / Programmer"
      },
      "1": {
        "description": "Student lab: Website prototyping, database design, website layout",
        "position": "Web Developer"
      }
    },
    "education": {
      "3": {
        "description": "Web application development",
        "position": "Higher Education, Bachelor"
      },
      "2": {
        "description": "Software development",
        "position": "Courses"
      },
      "1": {
        "description": "Software development and technologies in healthcare",
        "position": "Incomplete Higher Education"
      }
    }
  },
  "skills": {
    "title": "My Skills",
    "techskills": "Tech Skills",
    "softskills": "Soft Skills",
    "tools": "Tools",
    "language": "Languages",
    "softSkills": {
      "teamwork": "Teamwork",
      "communication": "Communication",
      "workWithCustomers": "Work with customers",
      "developmentMethodologies": "Development methodologies",
      "timeManagement": "Time management",
      "adaptability": "Adaptability",
      "creativity": "Creativity",
      "criticalThinking": "Critical thinking",
      "attentionToDetail": "Attention to detail"
    },
    "languages": {
      "english": "English",
      "russian": "Russian",
      "polish": "Polish",
      "belarusian": "Belarusian"
    }
  },
  "footer": {
    "clue": "up",
    "thankYou": "Thank you for watching",
    "connect": "Let's connect and explore how we can create impactful digital solutions together"
  },
  "sidebar": {
    "header": "Header",
    "about": "About",
    "skills": "Skills",
    "projects": "Projects",
    "experience": "Experience",
    "footer": "Footer"
  },
  "nda": {
    "title": "NDA Protected",
    "description": "Project Description:",
    "stack": "Technology Stack:",
    "reason": "Why the project cannot be shown:"
  },
  "petProjects": {
    "londonGrill": {
      "description": "London Grill is a modern restaurant-bar web application with a full ordering cycle.\n\nLondon Grill is a full-featured SPA for a restaurant-bar that demonstrates a comprehensive approach to building modern web interfaces. The project combines premium-style visual design with strong business logic: from a multi-level menu to authentication and order management.\n\nImplemented functionality:\n\nDynamic menu system:\n- multi-level tab navigation with drink categories (cocktails, infusions, wines, beer) and food categories (burgers, snacks);\n- automatic item generation from assets folder structure via Vite glob imports;\n- filtering by groups and subcategories with smooth transitions;\n- product cards with images, prices, volumes, and add-to-cart button.\n\nComplete cart and ordering flow:\n- quantity management (increment/decrement);\n- data persistence via localStorage with auto-sync;\n- real-time total price calculation;\n- table selection interface via custom dropdown;\n- header cart indicator with badge counter.\n\nFirebase authentication:\n- sign-up and sign-in via email/password;\n- protected routes (cart is available only for authorized users);\n- real-time auth status tracking via onAuthStateChanged;\n- logout button with current user email display.\n\nInternationalization (i18n):\n- EN/RU language switch without page reload;\n- full UI localization via context provider;\n- support for dynamic translations for auto-generated menu content.\n\nInteractive events slider:\n- custom promo slider with left/right navigation;\n- smooth CSS slide transition animations;\n- adaptive event cards with images and descriptions.\n\nLanding page with hero section:\n- large hero block with clear CTA elements;\n- highlights section with key advantages;\n- decorative elements (glow effects, patterns) for visual depth.\n\nNotification system:\n- ToastProvider for status messages (success, error, info);\n- automatic hide via timeout;\n- adaptive positioning for mobile devices.\n\nKey technical solutions:\n\nArchitecture and state management:\n- React with functional components and hooks;\n- MobX for reactive global cart state management;\n- Context API for i18n and toast system;\n- React Router v6 with dynamic navigation and protected routes.\n\nStyling and UX:\n- CSS Modules for component-level style isolation;\n- custom design system with CSS variables (sage/gold/warm palette);\n- responsive design via media queries and flexible grid/flexbox layouts;\n- smooth transitions and animations (fade, slide, hover effects);\n- image optimization with lazy loading and async decoding.\n\nPerformance and optimization:\n- Vite for instant HMR and optimized production builds;\n- useMemo for caching heavy computations (dynamic menu generation);\n- useCallback for memoizing event handlers;\n- dynamic image imports via glob patterns.\n\nFirebase integration:\n- Firebase Authentication with email/password provider;\n- secure config storage via environment variables (.env);\n- auth error handling with user-facing notifications.\n\nCode quality:\n- ESLint for static code analysis;\n- Prettier for consistent formatting;\n- configured ignore files to exclude build artifacts.\n\nDeployment:\n- project is configured for automatic deployment via Vercel with SPA routing support;\n- vercel.json configuration for correct client-side route handling;\n- use of environment variables for sensitive Firebase data."
    },
    "cyberX": {
      "description": "Telegram mini-app with interactive menu, API integration, and multi-language support."
    },
    "vinylStore": {
      "description": "Vinyl marketplace with product catalog, filters, cart flow, and backend integration."
    },
    "pet": {
      "description": "Pet-themed storefront with modern UI, sliders, and adaptive page structure."
    },
    "beats": {
      "description": "Music product landing with animated sections, sliders, and clean component architecture."
    },
    "nike": {
      "description": "Nike Product Slider is an interactive web component that showcases a modern product slider inspired by premium brand design. The project demonstrates a strong understanding of building visually engaging user interfaces with smooth animations and responsive behavior.\n\nImplemented functionality:\n- full-screen slider using CSS viewport-relative units (100vw / 100vh);\n- smooth transitions between slides with autoplay support;\n- manual navigation via left/right arrow controls;\n- layered typography effects (filled + outlined text) for visual depth;\n- animated shadows and floating effects for product images;\n- interactive rating system (stars) with fill logic up to the selected position;\n- functional BUY NOW button with a dynamic cart counter;\n- adaptive layout for all device sizes with dedicated breakpoints.\n\nKey technical solutions:\n- responsiveness: CSS Grid and Flexbox are used to create a flexible layout that adapts to any screen size;\n- performance: Vite provides fast builds and optimized asset loading;\n- UX: smooth CSS transitions and animations deliver natural interactions without lag;\n- state management: JavaScript logic controls current slide, counters, and animation states.\n\nDeployment:\n project is configured for automatic deployment to GitHub Pages via npm scripts."
    },
    "energo": {
      "description": "Corporate landing page focused on services, structure, and conversion-oriented blocks."
    },
    "indonesia": {
      "description": "Travel-style landing page with visual storytelling and responsive sections."
    },
    "building": {
      "description": "Construction company landing with service highlights and classic marketing layout."
    }
  },
  "businessProjects": {
    "gameItemsStore": {
      "title": "Game Items Store",
      "description": "Online store for game items for a large client. The project includes payment system integration and inventory management. Contains confidential information about customers and transactions, protected by NDA agreement."
    },
    "companyWebsite": {
      "title": "Company Website",
      "description": "Corporate website with admin panel. The project includes CRM integration and analytics. Contains confidential information about business processes, protected by NDA agreement."
    },
    "nftMarketplace": {
      "title": "NFT Marketplace",
      "description": "Platform for NFT trading with blockchain integration. The project includes smart contracts and collection management. Contains confidential information about transactions and users, protected by NDA agreement."
    },
    "companyWebsite2": {
      "title": "Company Website (Second)",
      "description": "Second corporate website focused on e-commerce. The project includes payment system integration and order management. Contains confidential information about customers and sales, protected by NDA agreement."
    },
    "telegramMiniApp": {
      "title": "Telegram Mini-App",
      "description": "Mini-app for Telegram with API integration. The project includes chat bots and data management. Contains confidential information about users and interactions, protected by NDA agreement."
    },
    "performanceSystem": {
      "title": "Performance System",
      "description": "Employee performance monitoring system. The project includes analytics and reports. Contains confidential information about personnel and metrics, protected by NDA agreement."
    }
  }
}
