{
  "header": {
    "greeting": "CZEŚĆ, nazywam się Danila Kulinkovich",
    "web": "WEB",
    "developer": "DEWELOPER",
    "email": "danek200326@gmail.com"
  },
  "nav": {
    "home": "Strona główna",
    "contact": "Kontakt",
    "skills": "Umiejętności",
    "projects": "Projekty",
    "experience": "Doświadczenie",
    "about": "O mnie"
  },
  "about": {
    "title": "O mnie",
    "subtitle": "Frontend Developer z doświadczeniem w tworzeniu przyjaznych dla użytkownika i wydajnych aplikacji internetowych. Mój podstawowy stos technologiczny obejmuje React, TypeScript, Vite, RTK Query i SCSS, ale pewnie pracuję również z Node.js, bazami danych, usługami chmurowymi i preprocesorami.",
    "text1": "Łączę silną wiedzę z zakresu frontendu ze solidnym zrozumieniem rozwoju backendu, co pozwala mi skutecznie przyczyniać się do całego cyklu rozwoju. Potrafię przekształcać projekty w czyste, responsywne interfejsy i efektywnie pracować z szeroką gamą bibliotek i narzędzi.",
    "text2": "Skupiam się na jakości kodu, optymalizacji wydajności i doświadczeniu użytkownika. Zawsze chętnie uczę się nowych technologii i podejmuję ekscytujące projekty."
  },
  "contact": {
    "title": "Kontakt",
    "subtitle": "Połączmy się i dowiedzmy się, jak możemy stworzyć skuteczne rozwiązania cyfrowe razem",
    "description": "W dowolny wygodny dla Ciebie sposób:",
    "formText": "Lub wyślij mi wiadomość bezpośrednio tutaj:",
    "name": "Twoje imię",
    "namePlaceholder": "Ivan",
    "email": "Twój email",
    "emailPlaceholder": "ivan@example.com",
    "message": "Twoja wiadomość",
    "messagePlaceholder": "Napisz swoją wiadomość...",
    "send": "Wyślij wiadomość",
    "sending": "Wysyłanie...",
    "success": "Wiadomość wysłana!",
    "error": "Błąd wysyłania. Spróbuj ponownie później."
  },
  "projects": {
    "title": "Moje Projekty",
    "all": "Wszystkie",
    "business": "Komercyjne",
    "pet": "Projekty osobiste",
    "infoBadge": "Informacje o projekcie"
  },
  "experience": {
    "title": "Doświadczenie",
    "workTitle": "Doświadczenie zawodowe",
    "educationTitle": "Wykształcenie",

    "work": {
      "3": {
        "description": "Tworzenie landing page, rozwój frontendu, projektowanie, tworzenie stron, praca z API, studiowanie/pisanie dokumentacji, wdrażanie projektów, integracja klient-serwer",
        "position": "Frontend Developer"
      },
      "2": {
        "description": "Kontakt z klientami, budowanie zespołu, rozwój frontendu",
        "position": "Administrator / Programista"
      },
      "1": {
        "description": "Laboratorium studenckie: prototypowanie stron, projektowanie baz danych, tworzenie stron",
        "position": "Web Developer"
      }
    },
    "education": {
      "3": {
        "description": "Tworzenie aplikacji webowych",
        "position": "Wyższe wykształcenie, Licencjat"
      },
      "2": {
        "description": "Tworzenie oprogramowania",
        "position": "Kursy"
      },
      "1": {
        "description": "Tworzenie oprogramowania i technologii w ochronie zdrowia",
        "position": "Nieukończone wyższe wykształcenie"
      }
    }
  },
  "skills": {
    "title": "Moje Umiejętności",
    "techskills": "Umiejętności Techniczne",
    "softskills": "Umiejętności Miękkie",
    "tools": "Narzędzia",
    "language": "Języki",
    "softSkills": {
      "teamwork": "Praca zespołowa",
      "communication": "Komunikacja",
      "workWithCustomers": "Praca z klientami",
      "developmentMethodologies": "Metodologie rozwoju",
      "timeManagement": "Zarządzanie czasem",
      "adaptability": "Adaptacyjność",
      "creativity": "Kreatywność",
      "criticalThinking": "Myślenie krytyczne",
      "attentionToDetail": "Uwaga na szczegóły"
    },
    "languages": {
      "english": "Angielski",
      "russian": "Rosyjski",
      "polish": "Polski",
      "belarusian": "Białoruski"
    }
  },
  "footer": {
    "clue": "na górę",
    "thankYou": "Dziękuję za oglądanie",
    "connect": "Połączmy się i sprawdźmy, jak możemy razem tworzyć skuteczne rozwiązania cyfrowe"
  },
  "sidebar": {
    "header": "Nagłówek",
    "about": "O mnie",
    "skills": "Umiejętności",
    "projects": "Projekty",
    "experience": "Doświadczenie",
    "footer": "Stopka"
  },
  "nda": {
    "title": "NDA Protected",
    "description": "Opis projektu:",
    "stack": "Stos technologiczny:",
    "reason": "Dlaczego projekt nie może być pokazany:"
  },
  "petProjects": {
    "londonGrill": {
      "description": "London Grill to nowoczesna aplikacja webowa dla restauracji-baru z pełnym cyklem zamówienia.\n\nLondon Grill to w pełni funkcjonalna aplikacja SPA dla restauracji-baru, która pokazuje kompleksowe podejście do tworzenia nowoczesnych interfejsów webowych. Projekt łączy atrakcyjny, premium design z rozbudowaną logiką biznesową: od wielopoziomowego menu po system autoryzacji i zarządzanie zamówieniami.\n\nZrealizowana funkcjonalność:\n\nDynamiczny system menu:\n- wielopoziomowa tabulacja z kategoriami napojów (koktajle, nalewki, wina, piwo) i jedzenia (burgery, przekąski);\n- automatyczne generowanie pozycji na podstawie struktury plików assets przez Vite glob imports;\n- filtrowanie po grupach i podkategoriach z płynnymi przejściami;\n- karty produktów ze zdjęciami, cenami, pojemnościami i przyciskiem dodania do koszyka.\n\nKompletny koszyk i system zamówień:\n- zarządzanie ilością produktów (inkrementacja/dekrementacja);\n- trwałość danych przez localStorage z automatyczną synchronizacją;\n- obliczanie sumy zamówienia w czasie rzeczywistym;\n- interfejs wyboru stolika przez custom dropdown;\n- wskaźnik liczby produktów w nagłówku z badge-counterem.\n\nAutoryzacja Firebase:\n- rejestracja i logowanie przez email/password;\n- chronione trasy (koszyk dostępny tylko dla zalogowanych użytkowników);\n- śledzenie statusu autoryzacji w czasie rzeczywistym przez onAuthStateChanged;\n- przycisk wylogowania z wyświetleniem emaila aktualnego użytkownika.\n\nInternacjonalizacja (i18n):\n- przełączanie języka EN/RU bez przeładowania strony;\n- pełna lokalizacja elementów interfejsu przez context provider;\n- obsługa dynamicznych tłumaczeń dla automatycznie generowanej zawartości menu.\n\nInteraktywny slider wydarzeń:\n- custom slider promocji z nawigacją lewo/prawo;\n- płynne animacje CSS przejść między slajdami;\n- responsywne karty wydarzeń ze zdjęciami i opisami.\n\nLanding page z sekcją hero:\n- duży blok hero z wyraźnymi CTA;\n- sekcja highlights z kluczowymi zaletami;\n- elementy dekoracyjne (efekty glow, patterny) dla większej głębi wizualnej.\n\nSystem powiadomień:\n- ToastProvider do wyświetlania komunikatów statusowych (sukces, błąd, informacja);\n- automatyczne ukrywanie po określonym timeout;\n- adaptacyjne pozycjonowanie na urządzeniach mobilnych.\n\nKluczowe rozwiązania techniczne:\n\nArchitektura i state management:\n- React z komponentami funkcyjnymi i hookami;\n- MobX do reaktywnego zarządzania globalnym stanem koszyka;\n- Context API dla i18n i systemu toastów;\n- React Router v6 z dynamiczną nawigacją i chronionymi trasami.\n\nStylizacja i UX:\n- CSS Modules do izolacji stylów komponentów;\n- custom design system oparty na CSS variables (paleta sage/gold/warm);\n- responsywny design przez media queries oraz elastyczne układy grid/flexbox;\n- płynne przejścia i animacje (fade, slide, hover effects);\n- optymalizacja obrazów przez lazy loading i async decoding.\n\nWydajność i optymalizacja:\n- Vite dla błyskawicznego HMR i zoptymalizowanego builda;\n- useMemo do cache’owania cięższych obliczeń (dynamiczne generowanie menu);\n- useCallback do memoizacji handlerów zdarzeń;\n- dynamiczne importy obrazów przez glob patterns.\n\nIntegracja Firebase:\n- Firebase Authentication z providerem email/password;\n- bezpieczne przechowywanie konfiguracji przez environment variables (.env);\n- obsługa błędów autoryzacji z komunikatami dla użytkownika.\n\nCode quality:\n- ESLint do statycznej analizy kodu;\n- Prettier do spójnego formatowania;\n- skonfigurowane pliki ignore do wykluczenia artefaktów builda.\n\nWdrożenie:\n- projekt skonfigurowany pod automatyczny deployment przez Vercel z obsługą SPA routingu;\n- konfiguracja vercel.json do poprawnej obsługi tras po stronie klienta;\n- wykorzystanie zmiennych środowiskowych dla wrażliwych danych Firebase."
    },
    "cyberX": {
      "description": "Mini-aplikacja Telegram z interaktywnym menu, integracją API i obsługą wielu języków."
    },
    "vinylStore": {
      "description": "Marketplace płyt winylowych z katalogiem, filtrami, koszykiem i integracją backendu."
    },
    "pet": {
      "description": "Tematyczny storefront z nowoczesnym UI, sliderami i responsywną strukturą stron."
    },
    "beats": {
      "description": "Landing produktu muzycznego z animacjami, sliderami i czystą architekturą komponentów."
    },
    "nike": {
      "description": "Nike Product Slider to interaktywny komponent webowy przedstawiający nowoczesny slider produktów inspirowany stylistyką marek premium. Projekt pokazuje dobre zrozumienie tworzenia atrakcyjnych interfejsów użytkownika z płynnymi animacjami i responsywnym układem.\n\nZrealizowana funkcjonalność:\n- pełnoekranowy slider oparty na jednostkach viewport CSS (100vw / 100vh);\n- płynne przejścia między slajdami z obsługą autoplay;\n- ręczna nawigacja za pomocą strzałek lewo/prawo;\n- wielowarstwowe efekty tekstowe (tekst wypełniony + konturowy) dla większej głębi wizualnej;\n- animowane cienie i efekt „unoszenia” obrazów produktów;\n- interaktywny system ocen (gwiazdki) z wypełnieniem do wybranej pozycji;\n- funkcjonalny przycisk BUY NOW z dynamicznym licznikiem produktów w koszyku;\n- adaptacyjny layout dla różnych urządzeń dzięki dedykowanym breakpoints.\n\nKluczowe rozwiązania techniczne:\n- responsywność: wykorzystanie CSS Grid i Flexbox do elastycznego układu dopasowującego się do każdego rozmiaru ekranu;\n- wydajność: Vite zapewnia szybki build i optymalne ładowanie zasobów;\n- UX: płynne przejścia i animacje CSS zapewniają naturalną interakcję bez opóźnień;\n- zarządzanie stanem: logika JavaScript zarządza aktualnym slajdem, licznikami i stanami animacji.\n\nWdrożenie:\n projekt jest skonfigurowany do automatycznego deploymentu na GitHub Pages za pomocą skryptów npm."
    },
    "energo": {
      "description": "Landing korporacyjny skupiony na usługach, strukturze i blokach konwersyjnych."
    },
    "indonesia": {
      "description": "Landing podróżniczy z wizualnym storytellingiem i responsywnymi sekcjami."
    },
    "building": {
      "description": "Landing firmy budowlanej z naciskiem na usługi i klasyczny układ marketingowy."
    }
  },
  "businessProjects": {
    "gameItemsStore": {
      "title": "Sklep z przedmiotami do gier",
      "description": "Sklep online z przedmiotami do gier dla dużego klienta. Projekt obejmuje integrację systemów płatności i zarządzanie zapasami. Zawiera poufne informacje o klientach i transakcjach, chronione umową NDA."
    },
    "companyWebsite": {
      "title": "Strona internetowa firmy",
      "description": "Strona korporacyjna z panelem administracyjnym. Projekt obejmuje integrację CRM i analitykę. Zawiera poufne informacje o procesach biznesowych, chronione umową NDA."
    },
    "nftMarketplace": {
      "title": "Rynek NFT",
      "description": "Platforma do handlu NFT z integracją blockchain. Projekt obejmuje inteligentne kontrakty i zarządzanie kolekcjami. Zawiera poufne informacje o transakcjach i użytkownikach, chronione umową NDA."
    },
    "companyWebsite2": {
      "title": "Strona internetowa firmy (druga)",
      "description": "Druga strona korporacyjna skupiająca się na e-commerce. Projekt obejmuje integrację systemów płatności i zarządzanie zamówieniami. Zawiera poufne informacje o klientach i sprzedaży, chronione umową NDA."
    },
    "telegramMiniApp": {
      "title": "Mini-aplikacja Telegram",
      "description": "Mini-aplikacja dla Telegram z integracją API. Projekt obejmuje boty czatowe i zarządzanie danymi. Zawiera poufne informacje o użytkownikach i interakcjach, chronione umową NDA."
    },
    "performanceSystem": {
      "title": "System wydajności",
      "description": "System monitorowania wydajności pracowników. Projekt obejmuje analitykę i raporty. Zawiera poufne informacje o personelu i metrykach, chronione umową NDA."
    }
  }
}
